import styled from 'styled-components';

const SPolicyContent = styled.div`
  line-height: 27px;
  div {
    margin-bottom: 16px;
  }
  h2 {
    font-weight: 600;
  }
  font-size: 16px;
  font-weight: 500;
`;
const serviceTermsContent = (
  <SPolicyContent>
    <h2>제 1조 목적</h2>
    <p>
      본 약관은 회원(본 약관에 동의한 자를 말하며 이하 "회원"이라고 합니다)이
      Tnote(이하 "회사"라고 합니다)가 제공하는 서비스를 이용함에 있어 회사와
      회원의 권리 의무 및 책임사항을 규정함을 목적으로 합니다.
    </p>
    <br />
    <h2>제 2조 정의</h2>

    <p>이 약관에서 사용하는 용어의 정의는 다음과 같습니다.</p>
    <ol>
      <li>
        1. "회원"이라 함은 회사의 서비스에 접속하여 이 약관에 따라 "회사"와
        이용계약을 체결하고 "회사"가 제공하는 "서비스" 를 이용하는 고객을
        말합니다.
      </li>
      <li>
        2. 아이디(ID)"라 함은 ”회원“의 식별과 ”서비스“ 이용을 위하여 ”회원“이
        정하고 ”회사“가 승인하는 문자와 숫자의 조합을 말합니다.
      </li>
      <li>
        3. "해지“라 함은 회사 또는 회원이 서비스 개통 후 이용계약을 해약하는
        것을 말합니다.
      </li>
      <li>
        4. “게시물”이라 함은 “회원”이 “서비스”를 이용함에 있어 “서비스상”에
        게시한 부호·문자·음성·음향·화상·동영상 등의 정보 형태의 글, 사진, 동영상
        및 각종 파일과 링크 등을 말합니다.
      </li>
    </ol>

    <br />
    <h2>제 3조 개인정보보호 의무</h2>
    <p>
      "회사"는 "정보통신망법" 등 관계 법령이 정하는 바에 따라 "회원"의
      "개인정보"를 보호하기 위해 노력합니다. "개인정보"의 보호 및 사용에
      대해서는 관련법 및 "회사"의 개인정보보호정책이 적용됩니다. 다만, "회사"의
      공식 사이트 이외의 링크된 사이트에서는 "회사"의 개인정보보호정책이
      적용되지 않습니다.
    </p>

    <br />
    <h2>제 4조 약관의 게시와 개정</h2>
    <ol>
      <li>
        1. "회사"는 이 약관의 내용을 "회원"이 쉽게 알 수 있도록 초기화면에
        게시합니다.
      </li>

      <li>
        2. "회사"는 "약관의규제에관한법률",
        "정보통신망이용촉진및정보보호에관한법률(이하 "정보통신망법")" 등
        관련법을 위배하지 않는 범위에서 이 약관을 개정할 수 있습니다.
      </li>
      <li>
        3. "회사"가 약관을 개정할 경우에는 적용일자 및 개정사유를 명시하여
        현행약관과 함께 제1항의 방식에 따라 그 개정약관의 적용일자 30일 전부터
        적용일자 전일까지 공지합니다. 다만, 회원에게 불리한 내용으로 약관을
        개정하는 경우에는 공지 외에 회원정보에 등록된 카카오 계정 등 전자적
        수단을 통해 별도로 명확히 통지하도록 합니다.
      </li>
      <li>
        4. "회사"가 전항에 따라 공지하면서 회원에게 30일 기간 이내에 의사표시를
        하지 않으면 승인한 것으로 본다는 뜻을 명확하게 공지하였음에도 회원이
        명시적으로 거부의사를 밝히지 않은 경우에 회원이 개정약관에 동의한 것으로
        봅니다.
      </li>
      <li>
        5. "회원"이 개정약관에 동의하지 않는 경우 회사는 개정약관의 내용을
        적용할 수 없으며, 이 경우 회원은 이용계약을 해지할 수 있습니다. 다만,
        기존 약관을 적용할 수 없는 특별한 사정이 있는 경우에는 회사는 이용계약을
        해지할 수 있습니다.
      </li>
    </ol>

    <br />
    <h2>제 5조 권리의 귀속 및 저작물의 이용</h2>
    <ol>
      <li>
        1. "서비스"에 대한 저작권 및 지적재산권은 회사에 귀속됩니다. 단, 회원의
        게시물 및 제휴계약에 따라 제공된 저작물 등은 제외합니다.
      </li>
      <li>
        2. "회사"는 서비스와 관련하여 회원에게 회사가 정한 이용조건에 따라 계정,
        아이디, 콘텐츠 등을 이용할 수 있는 이용권만을 부여하며, "회원"은 이를
        양도, 판매, 담보제공 등의 처분행위를 할 수 없습니다.
      </li>
    </ol>
    <br />

    <h2>제 6조 서비스의 변경, 중단, 일시 중지</h2>
    <ol>
      <li>
        1. 회사는 서비스의 일부 또는 전부를 회사의 사업 계획 및 서비스
        운영정책에 따라 수정·변경 및 중단할 수 있으며, 이에 대하여 관련 법령에
        특별한 규정이 없는 한 회원에게 별도의 보상을 하지 않습니다.
      </li>
      <li>
        2. 회사는 서비스용 설비 점검·보수·공사 및 기간통신사업자의 전기통신
        서비스의 중지, 서비스 이용의 폭주나 국가비상사태 등을 사유로 서비스
        제공에 장애가 발생한 경우 그 사유가 해소될 때까지 서비스를 일시 중지할
        수 있습니다.
      </li>
      <li>
        3. 회사는 본 조에 따른 서비스의 변경·중단·일시 중지의 사유가 발생한
        경우, 서비스를 통해 공지하는 등의 방법으로 회원에게 통지합니다.
      </li>
    </ol>
    <br />

    <h2>제 7조 "회원"에 대한 통지</h2>
    <ol>
      <li>
        1. "회사"가 "회원"에 대한 통지를 하는 경우 본 약관에 별도 규정이 없는 한
        "회원"이 지정한 카카오톡 계정, 전자우편 주소, 알림 메시지 등으로 할 수
        있습니다.
      </li>
      <li>
        2. "회사"는 "회원" 전체에 대한 통지의 경우 7일 이상 "회사"의 공지사항
        페이지 또는 팝업을 통해 게시함으로써 제1항의 통지에 갈음할 수 있습니다.
      </li>
    </ol>
    <br />

    <h2>제 8조 이용제한</h2>
    <ol>
      <li>
        1. "회사"는 "회원"이 본 약관의 의무를 위반하거나 서비스의 정상적인
        운영을 방해한 경우, 서비스 이용을 경고, 일시정지, 계약해지로 단계적으로
        제한할 수 있습니다.
      </li>
      <li>
        2. "회사"는 전항에도 불구하고, "저작권법" 및 "컴퓨터프로그램보호법"을
        위반한 불법프로그램의 제공 및 운영방해, "정보통신망법"을 위반한 불법통신
        및 해킹, 악성프로그램의 배포, 접속권한 초과행위 등과 같이 관련법을
        위반한 경우에는 즉시 계약해지를 할 수 있습니다. 본 항에 따른 계약해지 시
        서비스 이용을 통해 획득한 혜택 등도 모두 소멸되며, 회사는 이에 대해
        별도로 보상하지 않습니다.
      </li>
      <li>
        3. "회사"는 회원이 계속해서 3개월 이상 로그인하지 않는 경우, 회원정보의
        보호 및 운영의 효율성을 위해 이용을 제한할 수 있습니다.
      </li>
      <li>
        4. 회사는 본 조의 이용제한 범위 내에서 제한의 조건 및 세부내용은
        이용제한정책 등에서 정한 바에 의합니다.
      </li>
      <li>
        5. 본 조에 따라 서비스 이용을 제한하거나 계약을 해지하는 경우에는
        "회사"는 제 7조["회원"에 대한 통지]에 따라 통지합니다.
      </li>
      <li>
        6. "회원"은 본 조에 따른 이용제한 등에 대해 "회사"가 정한 절차에 따라
        이의신청을 할 수 있습니다. 이 때 이의가 정당하다고 회사가 인정하는 경우
        회사는 즉시 서비스의 이용을 재개합니다.
      </li>
    </ol>

    <br />
    <h2>제 9조 게시물의 관리</h2>
    <ol>
      <li>
        1. "회원"의 게시물이 "정보통신망법" 및 "저작권법"등 관련법에 위반되는
        내용을 포함하는 경우, 권리자는 관련법이 정한 절차에 따라 해당 게시물의
        게시중단 및 삭제 등을 요청할 수 있으며, "회사"는 관련법에 따라 조치를
        취하여야 합니다.
      </li>
      <li>
        2. "회사"는 전항에 따른 권리자의 요청이 없는 경우라도 권리침해가 인정될
        만한 사유가 있거나 기타 회사 정책 및 관련법에 위반되는 경우에는 관련법에
        따라 해당 게시물에 대해 임시조치 등을 취할 수 있습니다.
      </li>
      <li>
        3. 본 조에 따른 세부절차는 "정보통신망법" 및 "저작권법"이 규정한 범위
        내에서 회사가 정한 게시중단요청서비스에 따릅니다.
      </li>
    </ol>

    <br />
    <h2>제 10조 ‘회사'의 의무</h2>
    <ol>
      <li>
        1. '회사'는 관계법령, 본 약관이 금지하거나 공서양속에 반하는 행위를 하지
        않으며 약관이 정하는 바에 따라 지속적• 안정적으로 서비스를 제공하는데
        최선을 다하여야 합니다.
      </li>
      <li>
        2. '회사는 '이용자'가 안전하게 인터넷 서비스를 이용할 수 있도록
        개인정보(신용정보 포함)보호를 위한 보안 시스템을 갖추어야 합니다.
      </li>
      <li>
        3. '회사'가 상품에 대하여 '표시 • 광고의 공정화에 관한 법률' 제3조
        소정의 부당한 표시 • 광고행위를 하여 '이용자'가 손해를 입은 때에는 이를
        배상할 책임을 집니다.
      </li>
      <li>
        4. '회사'는 '이용자'의 수신동의 없이 영리목적으로 광고성 전자우편,
        휴대전화 메시지, 전화, 우편 등을 발송 하지 않습니다.
      </li>
    </ol>

    <br />
    <h2>제 11조 ‘회원’의 의무</h2>
    <ol>
      <li>
        1. '회원'는 회원가입 신청 시 사실에 근거하여 신청서를 작성해야 합니다.
        허위, 또는 타인의 정보를 등록 한 경우 '회사'에 대하여 일체의 권리를
        주장할 수 없으며, '회사'는 이로 인하여 발생한 손해에 대하여 책임 을
        부담하지 않습니다.
      </li>
      <li>
        2. '회원'는 본 약관에서 규정하는 사항과 기타 '회사'가 정한 제반 규정 및
        공지사항을 준수하여야 합니다. 또한 '이용자'는 '회사'의 업무를 방해하는
        행위 및 '회사'의 명예를 훼손하는 행위를 하여서는 안 됩니다.
      </li>
      <li>
        3. '회원'는 다음의 행위를 하여서는 안됩니다.
        <li> 가. 회사에 게시된 정보의 변경 </li>
        <li>나. '회사가 정한 정보 외의 다른 정보의 송신 또는 게시 </li>
        <li> 다. '회사 및 제3자의 저작권 등 지식재산권에 대한 침해 </li>
        <li>라. '회사 및 제3자의 명예를 훼손하거나 업무를 방해하는 행위 </li>
        <li>
          마. 외설 또는 폭력적인 메시지, 화상, 음성 기타 관계법령 및 공서양속에
          반하는 정보를 '회사'의 '사이트'에 공개 또는 게시하는 행위
        </li>
      </li>
      <li>
        4. 회원이 자신의 아이디(ID) 및 비밀번호를 도난당하거나 제3자가 사용하고
        있음을 인지한 경우에는 바로 ‘통보’하고 안내에 따라야 합니다.
      </li>
    </ol>

    <br />
    <br />
    <h2>부칙</h2>
    <h2>제 1조 시행일</h2>

    <p>본 약관은 2024.09.01 부터 적용합니다.</p>
  </SPolicyContent>
);

export default serviceTermsContent;
